
#### Terragrunt Plan `success`
<details><summary>Show Plan</summary>
```%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A  - destroy%0A%0ATerraform will perform the following actions:%0A%0A  # module.acr.azurerm_container_registry.self will be updated in-place%0A  ~ resource "azurerm_container_registry" "self" {%0A        id                            = "/subscriptions/3e16852e-8399-4c16-b246-16bf46bc3747/resourceGroups/sk8s-cluster/providers/Microsoft.ContainerRegistry/registries/sk8simgs"%0A        name                          = "sk8simgs"%0A      ~ public_network_access_enabled = true -> false%0A        tags                          = {}%0A        # (15 unchanged attributes hidden)%0A    }%0A%0A  # module.aks.azurerm_kubernetes_cluster.self will be updated in-place%0A  ~ resource "azurerm_kubernetes_cluster" "self" {%0A        id                                  = "/subscriptions/3e16852e-8399-4c16-b246-16bf46bc3747/resourceGroups/sk8s-cluster/providers/Microsoft.ContainerService/managedClusters/sk8s"%0A        name                                = "sk8s"%0A        tags                                = {}%0A        # (27 unchanged attributes hidden)%0A%0A      ~ default_node_pool {%0A            name                         = "hot"%0A          ~ tags                         = {%0A              + "owner"   = "GitHub Practice"%0A              + "project" = "Sk8s"%0A            }%0A            # (23 unchanged attributes hidden)%0A        }%0A%0A      + oms_agent {%0A          + log_analytics_workspace_id = (known after apply)%0A          + oms_agent_identity         = (known after apply)%0A        }%0A%0A        # (6 unchanged blocks hidden)%0A    }%0A%0A  # module.aks.azurerm_kubernetes_cluster_node_pool.self["win"] will be destroyed%0A  # (because key ["win"] is not in for_each map)%0A  - resource "azurerm_kubernetes_cluster_node_pool" "self" {%0A      - custom_ca_trust_enabled = false -> null%0A      - enable_auto_scaling     = true -> null%0A      - enable_host_encryption  = false -> null%0A      - enable_node_public_ip   = false -> null%0A      - fips_enabled            = false -> null%0A      - id                      = "/subscriptions/3e16852e-8399-4c16-b246-16bf46bc3747/resourceGroups/sk8s-cluster/providers/Microsoft.ContainerService/managedClusters/sk8s/agentPools/win" -> null%0A      - kubelet_disk_type       = "OS" -> null%0A      - kubernetes_cluster_id   = "/subscriptions/3e16852e-8399-4c16-b246-16bf46bc3747/resourceGroups/sk8s-cluster/providers/Microsoft.ContainerService/managedClusters/sk8s" -> null%0A      - max_count               = 3 -> null%0A      - max_pods                = 30 -> null%0A      - min_count               = 1 -> null%0A      - mode                    = "User" -> null%0A      - name                    = "win" -> null%0A      - node_count              = 1 -> null%0A      - node_labels             = {} -> null%0A      - node_taints             = [] -> null%0A      - orchestrator_version    = "1.25.11" -> null%0A      - os_disk_size_gb         = 128 -> null%0A      - os_disk_type            = "Managed" -> null%0A      - os_sku                  = "Windows2022" -> null%0A      - os_type                 = "Windows" -> null%0A      - priority                = "Regular" -> null%0A      - scale_down_mode         = "Delete" -> null%0A      - spot_max_price          = -1 -> null%0A      - tags                    = {} -> null%0A      - ultra_ssd_enabled       = false -> null%0A      - vm_size                 = "Standard_D2s_v3" -> null%0A      - vnet_subnet_id          = "/subscriptions/3e16852e-8399-4c16-b246-16bf46bc3747/resourceGroups/sk8s-cluster/providers/Microsoft.Network/virtualNetworks/sk8s-cluster-vnet/subnets/nodes" -> null%0A      - zones                   = [%0A          - "1",%0A          - "2",%0A          - "3",%0A        ] -> null%0A    }%0A%0A  # module.aks.azurerm_log_analytics_solution.self[0] will be created%0A  + resource "azurerm_log_analytics_solution" "self" {%0A      + id                    = (known after apply)%0A      + location              = "eastus"%0A      + resource_group_name   = "sk8s-cluster"%0A      + solution_name         = "ContainerInsights"%0A      + tags                  = {%0A          + "owner"   = "GitHub Practice"%0A          + "project" = "Sk8s"%0A        }%0A      + workspace_name        = "sk8s-cluster-logs"%0A      + workspace_resource_id = (known after apply)%0A%0A      + plan {%0A          + name      = (known after apply)%0A          + product   = "OMSGallery/ContainerInsights"%0A          + publisher = "Microsoft"%0A        }%0A    }%0A%0A  # module.aks.azurerm_log_analytics_workspace.self[0] will be created%0A  + resource "azurerm_log_analytics_workspace" "self" {%0A      + allow_resource_only_permissions    = true%0A      + daily_quota_gb                     = -1%0A      + id                                 = (known after apply)%0A      + internet_ingestion_enabled         = true%0A      + internet_query_enabled             = true%0A      + local_authentication_disabled      = false%0A      + location                           = "eastus"%0A      + name                               = "sk8s-cluster-logs"%0A      + primary_shared_key                 = (sensitive value)%0A      + reservation_capacity_in_gb_per_day = (known after apply)%0A      + resource_group_name                = "sk8s-cluster"%0A      + retention_in_days                  = (known after apply)%0A      + secondary_shared_key               = (sensitive value)%0A      + sku                                = "PerGB2018"%0A      + tags                               = {%0A          + "owner"   = "GitHub Practice"%0A          + "project" = "Sk8s"%0A        }%0A      + workspace_id                       = (known after apply)%0A    }%0A%0A  # module.aks.azurerm_monitor_diagnostic_setting.self[0] will be created%0A  + resource "azurerm_monitor_diagnostic_setting" "self" {%0A      + id                             = (known after apply)%0A      + log_analytics_destination_type = (known after apply)%0A      + log_analytics_workspace_id     = (known after apply)%0A      + name                           = "AKS Control Plane Logging"%0A      + target_resource_id             = "/subscriptions/3e16852e-8399-4c16-b246-16bf46bc3747/resourceGroups/sk8s-cluster/providers/Microsoft.ContainerService/managedClusters/sk8s"%0A%0A      + enabled_log {%0A          + category = "cloud-controller-manager"%0A%0A          + retention_policy {%0A              + days    = 7%0A              + enabled = true%0A            }%0A        }%0A      + enabled_log {%0A          + category = "cluster-autoscaler"%0A%0A          + retention_policy {%0A              + days    = 7%0A              + enabled = true%0A            }%0A        }%0A      + enabled_log {%0A          + category = "csi-azuredisk-controller"%0A%0A          + retention_policy {%0A              + days    = 7%0A              + enabled = true%0A            }%0A        }%0A      + enabled_log {%0A          + category = "csi-azurefile-controller"%0A%0A          + retention_policy {%0A              + days    = 7%0A              + enabled = true%0A            }%0A        }%0A      + enabled_log {%0A          + category = "csi-snapshot-controller"%0A%0A          + retention_policy {%0A              + days    = 7%0A              + enabled = true%0A            }%0A        }%0A      + enabled_log {%0A          + category = "kube-apiserver"%0A%0A          + retention_policy {%0A              + days    = 7%0A              + enabled = true%0A            }%0A        }%0A      + enabled_log {%0A          + category = "kube-controller-manager"%0A%0A          + retention_policy {%0A              + days    = 7%0A              + enabled = true%0A            }%0A        }%0A      + enabled_log {%0A          + category = "kube-scheduler"%0A%0A          + retention_policy {%0A              + days    = 7%0A              + enabled = true%0A            }%0A        }%0A%0A      + metric {%0A          + category = "AllMetrics"%0A          + enabled  = false%0A%0A          + retention_policy {%0A              + days    = 0%0A              + enabled = false%0A            }%0A        }%0A    }%0A%0A  # module.network.azurerm_subnet.self[1] will be updated in-place%0A  ~ resource "azurerm_subnet" "self" {%0A        id                                             = "/subscriptions/3e16852e-8399-4c16-b246-16bf46bc3747/resourceGroups/sk8s-cluster/providers/Microsoft.Network/virtualNetworks/sk8s-cluster-vnet/subnets/aci"%0A        name                                           = "aci"%0A        # (9 unchanged attributes hidden)%0A%0A      - delegation {%0A          - name = "aciDelegation" -> null%0A%0A          - service_delegation {%0A              - actions = [%0A                  - "Microsoft.Network/virtualNetworks/subnets/action",%0A                ] -> null%0A              - name    = "Microsoft.ContainerInstance/containerGroups" -> null%0A            }%0A        }%0A    }%0A%0A  # module.network.azurerm_subnet_network_security_group_association.self[1] will be created%0A  + resource "azurerm_subnet_network_security_group_association" "self" {%0A      + id                        = (known after apply)%0A      + network_security_group_id = "/subscriptions/3e16852e-8399-4c16-b246-16bf46bc3747/resourceGroups/sk8s-cluster/providers/Microsoft.Network/networkSecurityGroups/sk8s-cluster-vnet-nsg"%0A      + subnet_id                 = "/subscriptions/3e16852e-8399-4c16-b246-16bf46bc3747/resourceGroups/sk8s-cluster/providers/Microsoft.Network/virtualNetworks/sk8s-cluster-vnet/subnets/aci"%0A    }%0A%0APlan: 4 to add, 3 to change, 1 to destroy.```
</details>